# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [2083]:
# import libraries here
import pandas as pd
import numpy as np

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2084]:
# your code here
temp = pd.read_csv("Temp_States.csv")

#### Print `temp`.

In [2085]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [2086]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [2087]:
"""
your comments here   object , object and float
"""

'\nyour comments here   object , object and float\n'

#### Select the rows where state is New York.

In [2088]:
# your code here
new_york = (temp['State'] == 'New York')
temp[new_york]

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [2089]:
New_mean = temp[new_york]["Temperature"].mean()
New_mean

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [2090]:
# your code here
state_city_15 = temp[(temp ["Temperature"] > 15)]
city_15

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [2091]:
# your code here
city_15 = temp[(temp ["Temperature"] > 15)]
city_15

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [2092]:
# your code here
filtered_temp = temp[(temp ["Temperature"] > 15) & (temp ["Temperature"] < 20)]
filtered_temp

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [2093]:
# your code here
new_york = temp[(temp['State'] == 'New York')]
average_temps_new_york = new_york["Temperature"].mean()
print(round(average_temps_new_york,2))
print (round(new_york["Temperature"].std(),2))

10.74
8.13

In [2094]:
Connecticut_temp = temp[(temp['State'] == 'Connecticut')] 
average_temps_Connecticut = Connecticut_temp["Temperature"].mean()
print(round(average_temps_Connecticut,2))
print(round(Connecticut_temp["Temperature"].std(),2))

15.83
1.96

In [2095]:
new_jersey_temp = temp[(temp['State'] == 'New Jersey')]
average_temps_new_jersey = new_jersey_temp["Temperature"].mean()
print(round(average_temps_new_jersey,2))
print(round(new_jersey_temp["Temperature"].std(),2))

21.11
1.57

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [2096]:
# your code here

#### Explore the data types of the `employees` dataframe. Comment your results.

In [2097]:
# your code here

In [2098]:
"""
your comments here
"""

'\nyour comments here\n'

#### What's the average salary in this company?

In [2099]:
# your code here

#### What's the highest salary?

In [2100]:
# your code here

#### What's the lowest salary?

In [2101]:
# your code here

#### Who are the employees with the lowest salary?

In [2102]:
# your code here

#### Find all the information about an employee called David.

In [2103]:
# your code here

#### Could you return only David's salary?

In [2104]:
# your code here

#### Print all the rows where job title is associate.

In [2105]:
# your code here

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [2106]:
# Method 1
# your code here

In [2107]:
# Method 2
# your code here

#### Find the employees whose title is associate and whose salary is above 55.

In [2108]:
# your code here

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [2109]:
# your code here

####  What is the average salary per title?

In [2110]:
# your code here

####  Find the salary quartiles.

In [2111]:
# your code here

#### Is the mean salary different per gender?

In [2112]:
# your code here

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [2113]:
# your code here

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [2114]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [2115]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [2116]:
# your code here

In [2117]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [2118]:
# your code here

#### What are the highest and lowest purchase prices?

In [2119]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [2120]:
# your code here

#### How many customers do we have in Spain?

In [2121]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [2122]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [2123]:
# your code here

#### Select all free orders.

In [2124]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [2125]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [2126]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [2127]:
# your code here

#### Select all orders made in the month of August.

In [2128]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [2129]:
# your code here

#### What's the  average amount of money spent by country?

In [2130]:
# your code here

#### What's the most expensive item?

In [2131]:
# your code here

#### What is the average amount spent per year?

In [2132]:
# your code here